#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Completion styles
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/compstyle

# Keybindings
mattmc3/zephyr path:plugins/editor

# History
mattmc3/zephyr path:plugins/history

# Prompt
romkatv/powerlevel10k

# Utilities
zshzoo/macos conditional:is-macos
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions

romkatv/zsh-bench kind:path
ohmyzsh/ohmyzsh path:plugins/extract

# Other Fish-like features
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zpm-zsh/ls kind:defer
ohmyzsh/ohmyzsh path:plugins/mvn kind:defer